module.exports = {
    // 银行卡
    bankCard: /^(\d{16,19})$/,

    // 手机号（数字）
    mobile: /^1\d{10}$/,

    // 手机号（带空格`131 2233 4455`）
    mobileWithSpace: /^1\d{2}\s?\d{4}\s?\d{4}$/,

    // 身份证
    idCard: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|x|X)$)/,

    // 中文
    chinese: /^[\u4e00-\u9fa5]{0,}$/,

    // 中文（2-8位）
    chinese2to8: /^[\u4e00-\u9fa5\uF900-\uFA2D]{2,8}$/,

    
    // 整数或小数
    intOrFloat: /^[0-9]+\.{0,1}[0-9]{0,2}$/,

    // 整数
    int: /^[0-9]*$/,

    // 非零开头的数字
    noZeroStart: /^([1-9][0-9]*)$/,

    // 含有^%&',;=?$\"等特殊字符
    specialStr: /[^%&',;=?$\x22]+/,

    // 邮箱
    email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,

    // InternetURL地址
    httpUrl: /^http:\/\/([\w-]+\.)+[\w-]+(\/[\w-./?%&=]*)?$/,

    // 电话号码,正确格式为："XXX-XXXXXXX"、"XXXX-XXXXXXXX"、"XXX-XXXXXXX"、"XXX-XXXXXXXX"、"XXXXXXX"和"XXXXXXXX"
    tel: /^((\d{3,4}-)|\d{3.4}-)?\d{7,8}$/,

    // 货币校验
    money: /^\d+\.\d{2}$/,

    // 一年的12月，正确格式为："01"～"09"和"1"～"12"
    month: /^(0?[1-9]|1[0-2])$/,

    // 一个月的31天,正确格式为；"01"～"09"和"1"～"31"。
    day: /^((0?[1-9])|((1|2)[0-9])|30|31)$/,

    // 匹配html标签的正则表达式
    html: /<(.*)>(.*)<\/(.*)>|<(.*)\/>/,

    // 匹配空行的正则表达式
    spaceEnter: /\n[\s| ]*\r/,

    // qq号码
    qq: /^[1-9][0-9]{4,}$/,

    // 邮编
    zip: /^[\d]{6}/,
    
    // 匹配双字节字符(包括汉字在内)
    doubleByte: /[^\x00-\xff]/
  }